const CATEGORIES_TITLES = {
  view: 'Деталі категорії | Моя бухгалтерія',
  add: 'Додавання категорії | Моя бухгалтерія',
  edit: 'Редагування категорії | Моя бухгалтерія',
  delete: 'Видалення категорії | Моя бухгалтерія',
  default: 'Категорії витрат | Моя бухгалтерія',
};

const CURRENCIES_TITLES = {
  view: 'Деталі валюти | Моя бухгалтерія',
  add: 'Додавання валюти | Моя бухгалтерія',
  edit: 'Редагування валюти | Моя бухгалтерія',
  delete: 'Видалення валюти | Моя бухгалтерія',
  default: 'Валюти | Моя бухгалтерія',
};

export { CATEGORIES_TITLES, CURRENCIES_TITLES };
