const CATEGORIES_TITLES = {
  view: 'Деталі категорії | Моя бухгалтерія',
  add: 'Додавання категорії | Моя бухгалтерія',
  edit: 'Редагування категорії | Моя бухгалтерія',
  remove: 'Видалення категорії | Моя бухгалтерія',
  default: 'Категорії витрат | Моя бухгалтерія',
};

const CURRENCIES_TITLES = {
  view: 'Деталі валюти | Моя бухгалтерія',
  add: 'Додавання валюти | Моя бухгалтерія',
  edit: 'Редагування валюти | Моя бухгалтерія',
  remove: 'Видалення валюти | Моя бухгалтерія',
  default: 'Валюти | Моя бухгалтерія',
};

const ESTABLISHMENTS_TITLES = {
  view: 'Деталі закладу | Моя бухгалтерія',
  add: 'Додавання закладу | Моя бухгалтерія',
  edit: 'Редагування закладу | Моя бухгалтерія',
  remove: 'Видалення закладу | Моя бухгалтерія',
  default: 'Заклади | Моя бухгалтерія',
};

const EXPENSES_TITLES = {
  view: 'Деталі витрати | Моя бухгалтерія',
  add: 'Додавання витрати | Моя бухгалтерія',
  edit: 'Редагування витрати | Моя бухгалтерія',
  remove: 'Видалення витрати | Моя бухгалтерія',
  default: 'Витрати | Моя бухгалтерія',
};

const MEASURES_TITLES = {
  view: 'Деталі одиниці | Моя бухгалтерія',
  add: 'Додавання одиниці | Моя бухгалтерія',
  edit: 'Редагування одиниці | Моя бухгалтерія',
  remove: 'Видалення одиниці | Моя бухгалтерія',
  default: 'Одиниці вимірів | Моя бухгалтерія',
};

const PRODUCTS_TITLES = {
  view: 'Деталі товару/послуги | Моя бухгалтерія',
  add: 'Додавання товару/послуги | Моя бухгалтерія',
  edit: 'Редагування товару/послуги | Моя бухгалтерія',
  remove: 'Видалення товару/послуги | Моя бухгалтерія',
  default: 'Товари та послуги | Моя бухгалтерія',
};

export {
  CATEGORIES_TITLES,
  CURRENCIES_TITLES,
  ESTABLISHMENTS_TITLES,
  EXPENSES_TITLES,
  MEASURES_TITLES,
  PRODUCTS_TITLES,
};
