const CATEGORIES_TITLES = {
  view: 'Деталі категорії | Моя бухгалтерія',
  add: 'Додавання категорії | Моя бухгалтерія',
  edit: 'Редагування категорії | Моя бухгалтерія',
  delete: 'Видалення категорії | Моя бухгалтерія',
  default: 'Категорії витрат | Моя бухгалтерія',
};

const CURRENCIES_TITLES = {
  view: 'Деталі валюти | Моя бухгалтерія',
  add: 'Додавання валюти | Моя бухгалтерія',
  edit: 'Редагування валюти | Моя бухгалтерія',
  delete: 'Видалення валюти | Моя бухгалтерія',
  default: 'Валюти | Моя бухгалтерія',
};

const MEASURES_TITLES = {
  view: 'Деталі одиниці | Моя бухгалтерія',
  add: 'Додавання одиниці | Моя бухгалтерія',
  edit: 'Редагування одиниці | Моя бухгалтерія',
  delete: 'Видалення одиниці | Моя бухгалтерія',
  default: 'Одиниці вимірів | Моя бухгалтерія',
};

const PRODUCTS_TITLES = {
  view: 'Деталі товару/послуги | Моя бухгалтерія',
  add: 'Додавання товару/послуги | Моя бухгалтерія',
  edit: 'Редагування товару/послуги | Моя бухгалтерія',
  delete: 'Видалення товару/послуги | Моя бухгалтерія',
  default: 'Товари та послуги | Моя бухгалтерія',
};

export {
  CATEGORIES_TITLES,
  CURRENCIES_TITLES,
  MEASURES_TITLES,
  PRODUCTS_TITLES,
};
