export const PANEL_DATA = [
  {
    key: 'panel1',
    icon: 'account',
    title: 'Управління користувачами',
    items: [
      'Реєстрація та авторизація користувачів через email та пароль.',
      'Підтримка кількох ролей користувачів: адміністратори, модератори та звичайні користувачі.',
      'Керування правами доступу через систему ролей, що дозволяє контролювати доступ до функцій.',
      'Система дозволяє розширювати та змінювати права ролей користувачів відповідно до потреб.',
    ],
  },
  {
    key: 'panel2',
    icon: 'money',
    title: 'Облік витрат',
    items: [
      'Легке додавання нових витрат з вказанням суми, категорії, закладу та валюти.',
      'Сортування та фільтрація витрат по категоріях, закладах та за товарами та послугами.',
      'Витрати можна переглядати за періодами (день, тиждень, місяць, рік).',
      'Кожен користувач бачить лише власні витрати.',
      'Усі витрати в додатку ведуться в українській гривні.',
    ],
  },
  {
    key: 'panel3',
    icon: 'category',
    title: 'Категорії та товари/послуги',
    items: [
      'Створення та управління категоріями для витрат.',
      'Легке додавання товарів або послуг для кожної транзакції.',
      'Можливість змінювати категорії та товари/послуги в разі потреби.',
      'Можливість створювати та редагувати одиниці виміру для товарів та послуг.',
    ],
  },
  {
    key: 'panel4',
    icon: 'chart',
    title: 'Візуалізація даних статистики',
    items: [
      'Витрати можна відслідковувати за категоріями, закладами, товарами та послугами.',
      'Перегляд даних за різні періоди часу: день, тиждень, місяць, рік.',
      'Аналітика для відслідковування тенденцій фінансів за різними параметрами.',
    ],
  },
  {
    key: 'panel5',
    icon: 'phone',
    title: 'Мобільна адаптація',
    items: [
      'Гнучкий дизайн для роботи на різних пристроях, в тому числі на мобільних пристроях.',
      'Адаптивний інтерфейс для зручності користування на різних екранах.',
    ],
  },
  {
    key: 'panel6',
    icon: 'settings',
    title: 'Система ролей та прав доступу',
    items: [
      'Гнучка система ролей: адміністратори, модератори та користувачі.',
      'Ролі визначають доступ до функцій: адміністратори можуть керувати користувачами, модератори — контентом, а користувачі — своїми витратами.',
      'Адміністратори можуть створювати, редагувати та видаляти користувачів, управління ролями та правами доступу.',
      'Модератори мають доступ до редагування категорій, закладів та товарів.',
    ],
  },
];
